[
  {
    "id": 1,
    "title": "Anchorr Banking App UX Case Study",
    "scope": "UI/UX Design",
    "summary": "A fintech concept app merging banking and investing into one seamless, trust‑focused experience.",
    "details": "Anchorr was a 2021 UI/UX design case study aimed at tackling a common frustration in personal finance: the fragmentation between banking and investment services. The project explored how a single mobile platform could unify savings accounts, cash transfers, and brokerage features into one intuitive interface. The design process emphasized clarity, trust, and simplicity, ensuring that complex financial workflows were presented in a way that felt approachable to everyday users. Anchorr’s design system was built to balance modern fintech aesthetics with user‑centric functionality, resulting in a prototype that demonstrated how thoughtful design can simplify complexity while fostering user confidence in financial management.",
    "year": 2021,
    "preview": "https://www.behance.net/gallery/158325619/ANCHORR-MOBILE-CASE-STUDY",
    "thumbnail": "Anchorr.png",
    "features": [
      "Unified savings and investment dashboard",
      "Streamlined cash transfers",
      "Modern fintech design system",
      "Trust‑focused user experience"
    ],
    "stacks": ["Figma", "Adobe XD"],
    "category": "ux",
    "role": "UX Designer",
    "duration": "2 months",
    "teamSize": "Solo Project",
    "challenges": "Keeping financial workflows simple without losing essential detail.",
    "impact": "Proved that good design can simplify complexity while building trust."
  },
  {
    "id": 2,
    "title": "CryptoCard Dashboard",
    "scope": "Web Development",
    "summary": "An interactive crypto dashboard with live charts, filtering, and market trend insights.",
    "details": "CryptoCard is a 2025 web development project designed to give cryptocurrency enthusiasts a responsive, data‑driven dashboard for tracking market performance. The platform integrates live data from the CoinGecko API, presenting it through wide interactive charts, sparklines, and coin cards that highlight percentage changes. Users can filter gainers and losers, search coins with persistence via local storage, and navigate seamlessly with back button support. The dashboard was built with React, TailwindCSS, Vite, and Chart.js, ensuring both performance and responsiveness across devices. The project’s main challenge was integrating real‑time API data while maintaining smooth chart responsiveness, ultimately delivering a modern analytics tool that empowers users to make informed decisions in a fast‑moving market.",
    "year": 2025,
    "preview": "https://crypto-card-six.vercel.app/",
    "thumbnail": "CryptoCard.png",
    "features": [
      "Wide responsive chart with range selector",
      "Coin cards with sparklines and % change indicators",
      "Search bar with icon, button, and filters",
      "Local storage persistence for last searched coin",
      "Back button navigation",
      "Filter cards for gainers/losers",
      "Live API integration with auto-refresh"
    ],
    "stacks": ["React", "TailwindCSS", "Vite", "Chart.js", "CoinGecko API"],
    "category": "web",
    "role": "Frontend Developer",
    "duration": "5 weeks",
    "teamSize": "Solo",
    "challenges": "Ensuring charts were responsive and contained across devices, integrating live API data smoothly.",
    "impact": "Delivered a modern crypto dashboard that improves user insight into market trends."
  },
  {
    "id": 3,
    "title": "Sella Ecommerce Website",
    "scope": "Web Development",
    "summary": "A full ecommerce solution with catalog, cart, checkout, and user authentication flows.",
    "details": "Sella Ecommerce Website is a 2025 project that delivers a complete online shopping experience tailored to Sella’s brand identity. The platform includes a product catalog with filtering and sorting, a shopping cart powered by React Context, and a simulated secure checkout flow. It also integrates user authentication and profile management, ensuring personalized shopping journeys. Built with React, TailwindCSS, and Vite, the site emphasizes responsive design and accessibility across devices. Additional features include category browsing, detailed product pages, and a polished contact page powered by EmailJS. The project’s complexity lay in integrating multiple flows authentication, cart, checkout, and contact, while maintaining smooth performance and consistent UX. The result was a robust ecommerce solution that demonstrates mastery of end‑to‑end shopping flows and modern frontend development practices.",
    "year": 2025,
    "preview": "https://sella-three.vercel.app/",
    "thumbnail": "Sella.png",
    "features": [
      "Product catalog with filtering and sorting",
      "Shopping cart with add/remove/update functionality",
      "Checkout flow with simulated payments",
      "User authentication and profile management",
      "Responsive design across devices",
      "Category browsing and product detail pages",
      "Contact page with EmailJS integration"
    ],
    "stacks": ["React", "TailwindCSS", "Vite", "Context API", "EmailJS"],
    "category": "web",
    "role": "Frontend Developer",
    "duration": "4 months",
    "teamSize": "Solo",
    "challenges": "Integrating multiple flows (auth, cart, checkout, contact) while keeping performance and UX smooth.",
    "impact": "Delivered a complete ecommerce platform for Sella, showcasing ability to build complex, user‑friendly applications."
  }
]